#define _CRT_SECURE_NO_WARNINGS
/*
无符号的二进制表达：
0000-》分别对应的2的三次方到二的零次方
即8，4，2，1
则能表示的无符号的数是从0到15这16个数
int有32位，则是0到2的32次方

有符号
非负数
0：0000，4位的数字第一个数表示符号，0为非负数，1为负数；其余三位表述数值
...7：0111一共能表示8个数

负数：
-1：1111  
-2：1110   
就是整数的所有位取反再加一
-8：1000   
同样的给出四个数也可以用取反加一来知道它到底是负几

4位可以表示-8到0到7的数字




二进制在16进制的表达：
0000-》0
1010-》a

0110 1110-》0x6e
*/


/*
~取反
取反后加1是相反数
有符号整数最小的数字是转不到相反数的
因为转了之后还是它本身例如-8和8的数字是一样的，但是正数那边没有一个较大的数与之对应


|或运算
1010|1100=1110有一就会留下来          0或x结果还是x
1010
1100
1110

&与运算
1010&1100=1000都是1才会留下来          1与x结果还是x
1010
1100
1000

^异或运算
1010^1100=0110相同位是0，不同位是1
1010
1100
0110

>>右移1位
0011-》0001，右移之后自动补零

*/
#include<stdio.h>
int main()
{
	int a = 0b0001010;
	int b = 0b0000110;
	printf("%d\n", a | b);
	printf("%d\n", a & b);
	printf("%d\n", a ^ b);
	return 0;
}